org/pomodorocoder.org
#+TITLE: Pomodoro Coder

#+HUGO_BASE_DIR: ./temp/
#+HUGO_SECTION: ./
#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t

***** Virtual DOM
:PROPERTIES:
:EXPORT_FILE_NAME: virtual-dom
:EXPORT_DATE: <2017-11-13 Mon>
:END:
****** Objectives
       - Describe the virtual DOM
       - Define a synthetic events
       - Describe changes in React 16

****** Definition
       - Virtual DOM is a data structure stored by React that tracks changes from one render state to the next.
       - If something has changed from one render to the next, the browser's DOM is updated (Reconciliation)

****** Synthetic Events
       - Supports all the native brower events, but provides a consistent API on all browsers

****** React 16, What's New?
       - Render can return an array of JSX elements or a string
#+begin_src js
render(){
    return[
            <div key="a"> First Element</div>,
            <div key="b"> Second Element</div>
    ]
}
#+end_src
       - [[https://www.youtube.com/watch?v=ZCuYPiUIONs][Fiber]] is a reconciliation engine

